<script>
    import Result from './Result.svelte'
    
    let search_value = '';
    let search_type = 0;
    let username = 'sandy';
    let search_placeholder = ['literals', 'tags', 'nominatives', 'shapes'];
    let search_api_options = ['text', 'tags', 'nomins', 'shapes']

    function submitSearch() {
      part_type = search_api_options[search_type];
    }

    function addSource() {
      
    }
    
    let results = [
    {
        "left": ", ибо без этого нельзя обвинять . \" А может быть , падучая была настоящая . Больной вдруг очнулся , услыхал крик , вышел \" — ну и что же ? Посмотрел да и сказал себе :",
        "left_reverse": ": ебес лазакс и ад лертомсоП ? еж отч и ун — \" лешыв , кирк лахылсу , яслунчо гурдв йоньлоБ . яащяотсан алыб яачудап , ьтыб тежом А \" . ьтянивбо язьлен оготэ зеб оби ,",
        "center": "дай пойду убью барина",
        "center_reverse": "анираб юьбу удйоп йад",
        "right": "? А почему он узнал , что тут было , что тут происходило , ведь он до сих пор лежал в беспамятстве ? А впрочем , господа , есть предел и фантазиям . \" Так - с",
        "source": "https://ilibrary.ru/text/1199/p.88/index.html",
        "title": "Ф. М. Достоевский. Братья Карамазовы. Текст произведения. Часть четвертая. Книга двенадцатая. VIII. Трактат о Смердякове"
    },
    {
        "left": "от себя отдалении , среди сада , убегающего к стороне забора ... Митя еще с половины речи вскочил со стула . — Вздор ! — завопил он вдруг в исступлении , — наглый обман ! Он не",
        "left_reverse": "ен нО ! намбо йылган — , иинелпутсси в гурдв но липоваз — ! родзВ — . алутс ос личоксв ичер ыниволоп с еще ятиМ ... аробаз еноротс к огещюагебу , адас идерс , иинеладто ябес то",
        "center": "мог видеть отворенную дверь",
        "center_reverse": "ьревд юуннеровто ьтедив гом",
        "right": ", потому что она была тогда заперта ... Он лжет ! .. — Долгом считаю вам повторить , что показание его твердое . Он не колеблется . Он стоит на нем . Мы несколько раз его переспрашивали",
        "source": "https://ilibrary.ru/text/1199/p.60/index.html",
        "title": "Ф. М. Достоевский. Братья Карамазовы. Текст произведения. Часть третья. Книга девятая. VI. Прокурор поймал Митю"
    },
    {
        "left": "любовью после пяти лет завершить законным браком обиду . Ну и понял , что всё для меня пропало ... А сзади позор , и вот эта кровь , кровь Григория ... Зачем же жить ? Ну и",
        "left_reverse": "и уН ? ьтиж еж мечаЗ ... яирогирГ ьворк , ьворк атэ тов и , розоп идазс А ... олапорп янем ялд ёсв отч , ляноп и уН . удибо мокарб мынноказ ьтишреваз тел итяп елсоп юьвобюл",
        "center": "пошел выкупать заложенные пистолеты",
        "center_reverse": "ытелотсип еыннежолаз ьтапукыв лешоп",
        "right": ", чтобы зарядить и к рассвету себе пулю в башку всадить ... — А ночью пир горой ? — Ночью пир горой . Э , черт , господа , кончайте скорей . Застрелиться я хотел наверно ,",
        "source": "https://ilibrary.ru/text/1199/p.59/index.html",
        "title": "Ф. М. Достоевский. Братья Карамазовы. Текст произведения. Часть третья. Книга девятая. V. Третье мытарство"
    },
    {
        "left": "ждали для сего нарочно сей минуты , видимо уповая на немедленную силу исцеления , какая , по вере их , не могла замедлить обнаружиться . И вот тут только обнаружилось , до какой степени все у нас",
        "left_reverse": "сан у есв инепетс йокак од , ьсолижуранбо окьлот тут тов И . ясьтижуранбо ьтилдемаз алгом ен , хи ерев оп , яакак , яинелецси улис юуннелдемен ан яавопу омидив , ытуним йес ончоран огес ялд иладж",
        "center": "приобыкли считать усопшего старца",
        "center_reverse": "ацратс огешпосу ьтатичс илкыбоирп",
        "right": "еще при жизни его за несомненного и великого святого . И между прибывающими были далеко не из одного лишь простонародья . Это великое ожидание верующих , столь поспешно и обнаженно выказываемое и даже с нетерпением и чуть",
        "source": "https://ilibrary.ru/text/1199/p.43/index.html",
        "title": "Ф. М. Достоевский. Братья Карамазовы. Текст произведения. Часть третья"
    },
    {
        "left": "была о старце : он трепетал за него , за славу его , боялся оскорблений ему , особенно тонких , вежливых насмешек Миусова и недомолвок свысока ученого Ивана , так это всё представлялось ему . Он даже",
        "left_reverse": "ежад нО . уме ьсолялватсдерп ёсв отэ кат , анавИ огонечу акосывс ковломоден и авосуиМ кешемсан хывилжев , хикнот оннебосо , уме йинелброксо ясляоб , оге увалс аз , оген аз латеперт но : ецратс о алыб",
        "center": "хотел рискнуть предупредить старца",
        "center_reverse": "ацратс ьтидерпудерп ьтунксир летох",
        "right": ", сказать ему что - нибудь об этих могущих прибыть лицах , но подумал и промолчал . Передал только накануне назначенного дня чрез одного знакомого брату Дмитрию , что очень любит его и ждет от него исполнения",
        "source": "https://ilibrary.ru/text/1199/p.6/index.html",
        "title": "Ф. М. Достоевский. Братья Карамазовы. Текст произведения. Часть первая. Книга первая. V. Старцы"
    }
]

    
</script>

<main>

    <div>
        <h1>Time to search, {username || 'stranger'}!</h1>
    </div>

    <div class="search">
        <input bind:value={search_value}
               on:keydown="{event => event.key === 'Enter' && submitSearch()}"
               placeholder={search_placeholder[search_type]}>
        <button on:click={submitSearch}>Search</button>
        
        <label>
            <input type=radio bind:group={search_type} value={0}>
            Literals
        </label>
        <label>
            <input type=radio bind:group={search_type} value={1}>
            Tags
        </label>
        <label>
            <input type=radio bind:group={search_type} value={2}>
            Nominatives
        </label>
        <label>
            <input type=radio bind:group={search_type} value={3}>
            Shapes
        </label>
    </div>

    <div class="results">
        <h2>Corpus results</h2>
        {#each results as result, i}
          <Result result={result} i={i}/>
        {/each}
    </div>
    
</main>



<style>
    h1 {
      text-align: center;
      color: #ff3e00;
      font-size: 3em;
      font-weight: 200;
    }
    
    main {
      /* text-align: center; */
      max-width: none;
      padding: 3em;
    }

    .search {
      margin-left: auto;
      margin-right: auto;
      width: 320px;
      max-width: 100%;
    }

    .results {
      margin-left: auto;
      margin-right: auto;
      width: 800px;
      max-width: 100%;
    }    
</style>
